import torch

t = torch.arange(0, 36).reshape(6, 6)
print(t)
t = t.reshape(3, 2, 3, 2)
print(t)
t = t.permute(0, 2, 1, 3)
print(t)
t = t.reshape(36)
print(t)

# merge操作需要将相邻的块进行融合，即[0， 1， 6， 7]merge成一个，[2, 3, 8, 9]merge成一个
# tensor([[ 0,  1,  2,  3,  4,  5],
#         [ 6,  7,  8,  9, 10, 11],
#         [12, 13, 14, 15, 16, 17],
#         [18, 19, 20, 21, 22, 23],
#         [24, 25, 26, 27, 28, 29],
#         [30, 31, 32, 33, 34, 35]])

# 经过处理，tensor将相邻的块组合到一起，满足merge需要的数据要求
# tensor([ 0,  1,  6,  7,  2,  3,  8,  9,  4,  5, 10, 11, 12, 13, 18, 19, 14, 15,
#         20, 21, 16, 17, 22, 23, 24, 25, 30, 31, 26, 27, 32, 33, 28, 29, 34, 35])